"use strict";

// task 1

console.log(
  "Створіть три однакові за змістом рядки з різними лапками(одинарні, подвійні, зворотні) та виведіть у консоль.",
);

console.log(
  'Створіть три однакові за змістом рядки з різними лапками(одинарні, подвійні, зворотні) та виведіть у консоль.',
);

console.log(
  `Створіть три однакові за змістом рядки з різними лапками(одинарні, подвійні, зворотні) та виведіть у консоль.`,
);

// task 2

// Друг спосіб: використання зворотних лапок (template literals) для уникнення екранування лапок всередині рядка зручніший,
// оскільки зворотні лапки дозволяють включати як одинарні, так і подвійні лапки без необхідності екранування.

console.log("Він сказав: \"Це — 'звичайна' помилка\"");

console.log(`Він сказав: "Це — 'звичайна' помилка"`);

// task 3

const name = "John";
const age = 30;
const city = "New York";

console.log(
  `Привіт! Мене звати ${name}, мені ${age} років, живу у ${city}.${age + 12}`,
);

// task 4

const str = `Привіт! Мене звати ${name}, мені ${age} років, живу у ${city}.${age + 12}`;

console.log(str.length);

console.log(str[0]);

console.log(str[4]);

console.log(str[str.length - 1]);

// task 5

//Pядок не змінився, помилки не було. Рядки в JavaScript immutable (незмінні).

const greeting = "Hello";
greeting[0] = "J";
console.log(greeting);